---
kind: method
id: M:Autodesk.Revit.DB.TableData.IsEqual(Autodesk.Revit.DB.TableData)
source: html/1dbaa75b-3eca-c000-807c-5cac1cfc5fdb.htm
---
# Autodesk.Revit.DB.TableData.IsEqual Method

Checks if this element is equal in value to the other element.

## Syntax (C#)
```csharp
public bool IsEqual(
	TableData OtherElem
)
```

## Parameters
- **OtherElem** (`Autodesk.Revit.DB.TableData`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null